### PROJECT DESCRIPTION

This store sales forecasting project offers a valuable resource for businesses operating in the retail furniture sector. 
By analyzing historical sales data from the superstore dataset, users can gain insights into future sales patterns and trends. 
This information can be utilized to optimize inventory management strategies, anticipate customer demand, and enhance overall operational efficiency.

In [25]:
import pandas as pd

In [26]:
holiday_df = pd.read_csv('datasets/holidays_events.csv')
print(holiday_df.shape)
print(holiday_df.info())
holiday_df.head()

(350, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB
None

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [27]:
oil_df = pd.read_csv('datasets/oil.csv') 
print(oil_df.shape)
print(oil_df.info()) 
oil_df.head()

(1218, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB
None

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [28]:
store_df = pd.read_csv('datasets/stores.csv') 
print(store_df.shape)
print(store_df.info())
store_df.head()

(54, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB
None

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [29]:
test_df = pd.read_csv('datasets/test.csv') 
print(test_df.shape)
print(test_df.info())
test_df.head()

(28512, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB
None

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [30]:
train_df = pd.read_csv('datasets/train.csv') 
print(train_df.shape)
print(train_df.info)
train_df.head()

(3000888, 6)
<bound method DataFrame.info of               id        date  store_nbr                      family     sales  \
0              0  2013-01-01          1                  AUTOMOTIVE     0.000
1              1  2013-01-01          1                   BABY CARE     0.000
2              2  2013-01-01          1                      BEAUTY     0.000
3              3  2013-01-01          1                   BEVERAGES     0.000
4              4  2013-01-01          1                       BOOKS     0.000
...          ...         ...        ...                         ...       ...
3000883  3000883  2017-08-15          9                     POULTRY   438.133
3000884  3000884  2017-08-15          9              PREPARED FOODS   154.553
3000885  3000885  2017-08-15          9                     PRODUCE  2419.729
3000886  3000886  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
3000887  3000887  2017-08-15          9                     SEAFOOD    16.000

         onpromotion
0                  0
1                  0
2                  0
3                  0
4                  0
...              ...
3000883            0
3000884            1
3000885          148
3000886            8
3000887            0

[3000888 rows x 6 columns]>

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [31]:
transaction_df = pd.read_csv('datasets/transactions.csv')
print(transaction_df.shape)
print(transaction_df.info()) 
transaction_df.head()

(83488, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB
None

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

#### checking for null values in the datasets

In [32]:
holiday_df.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [33]:
oil_df.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [34]:
store_df.isna().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [35]:
train_df.isna().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [36]:
transaction_df.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

### Exploratory Data Analysis

Converting time to timestamps

In [37]:
def timestamps(df):
    df['date'] = pd.to_datetime(df['date'])
    df['weekday'] = df['date'].dt.weekday
    df['month'] = df['date'].dt.month 
    df['day_of_year'] = df['date'].dt.dayofyear
    df['quarter'] = df['date'].dt.quarter
    
    
    df = df.drop(columns=['date']) 
    return df

In [38]:
holiday_df = timestamps(holiday_df)
holiday_df.head()

,type,locale,locale_name,description,transferred,weekday,month,day_of_year,quarter
0,Holiday,Local,Manta,Fundacion de Manta,False,4,3,62,1
1,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False,6,4,92,2
2,Holiday,Local,Cuenca,Fundacion de Cuenca,False,3,4,103,2
3,Holiday,Local,Libertad,Cantonizacion de Libertad,False,5,4,105,2
4,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False,5,4,112,2

In [39]:
oil_df = timestamps(oil_df)
oil_df.head()

   dcoilwtico  weekday  month  day_of_year  quarter
0         NaN        1      1            1        1
1       93.14        2      1            2        1
2       92.97        3      1            3        1
3       93.12        4      1            4        1
4       93.20        0      1            7        1

In [40]:
test_df = timestamps(test_df)
test_df.head()

,id,store_nbr,family,onpromotion,weekday,month,day_of_year,quarter
0,3000888,1,AUTOMOTIVE,0,2,8,228,3
1,3000889,1,BABY CARE,0,2,8,228,3
2,3000890,1,BEAUTY,2,2,8,228,3
3,3000891,1,BEVERAGES,20,2,8,228,3
4,3000892,1,BOOKS,0,2,8,228,3

In [41]:
train_df = timestamps(train_df)
train_df.head()

,id,store_nbr,family,sales,onpromotion,weekday,month,day_of_year,quarter
0,0,1,AUTOMOTIVE,0.0,0,1,1,1,1
1,1,1,BABY CARE,0.0,0,1,1,1,1
2,2,1,BEAUTY,0.0,0,1,1,1,1
3,3,1,BEVERAGES,0.0,0,1,1,1,1
4,4,1,BOOKS,0.0,0,1,1,1,1

In [42]:
transaction_df = timestamps(transaction_df)
transaction_df.head()

   store_nbr  transactions  weekday  month  day_of_year  quarter
0         25           770        1      1            1        1
1          1          2111        2      1            2        1
2          2          2358        2      1            2        1
3          3          3487        2      1            2        1
4          4          1922        2      1            2        1

In [43]:
# Ensure each DataFrame's 'Timestamp' column is in datetime format
dataframes = [
    holiday_df,
    oil_df,
    transaction_df,
    train_df
]



# Now concatenate all DataFrames along the rows
merged_data = pd.concat(dataframes, ignore_index=True)

# Sort by 'Timestamp' and reset the index
merged_data = merged_data.sort_values(by='year').reset_index(drop=True)

# Display the merged DataFrame
print(merged_data)

KeyError: 'year'

In [ ]:
merged_data.head()

,type,locale,locale_name,description,transferred,year,month,day,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion
0,Holiday,Local,Manta,Fundacion de Manta,False,2012,3,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Holiday,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,2012,11,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Holiday,Regional,Santa Elena,Provincializacion Santa Elena,False,2012,11,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Holiday,Local,Guaranda,Independencia de Guaranda,False,2012,11,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Holiday,Local,Latacunga,Independencia de Latacunga,False,2012,11,11,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
merged_data = pd.merge(merged_data, store_df, on='store_nbr', how='left')
merged_data.head()

,type_x,locale,locale_name,description,transferred,year,month,day,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion,city,state,type_y,cluster
0,Holiday,Local,Manta,Fundacion de Manta,False,2012,3,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Holiday,Regional,Santo Domingo de los Tsachilas,Provincializacion de Santo Domingo,False,2012,11,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Holiday,Regional,Santa Elena,Provincializacion Santa Elena,False,2012,11,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Holiday,Local,Guaranda,Independencia de Guaranda,False,2012,11,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Holiday,Local,Latacunga,Independencia de Latacunga,False,2012,11,11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3085944 entries, 0 to 3085943
Data columns (total 19 columns):
 #   Column        Dtype
---  ------        -----
 0   type_x        object
 1   locale        object
 2   locale_name   object
 3   description   object
 4   transferred   object
 5   year          int32
 6   month         int32
 7   day           int32
 8   dcoilwtico    float64
 9   store_nbr     float64
 10  transactions  float64
 11  id            float64
 12  family        object
 13  sales         float64
 14  onpromotion   float64
 15  city          object
 16  state         object
 17  type_y        object
 18  cluster       float64
dtypes: float64(7), int32(3), object(9)
memory usage: 412.0+ MB

In [ ]:
merged_data.isna().sum()

type_x          3085594
locale          3085594
locale_name     3085594
description     3085594
transferred     3085594
year                  0
month                 0
day                   0
dcoilwtico      3084769
store_nbr          1568
transactions    3002456
id                85056
family            85056
sales             85056
onpromotion       85056
city               1568
state              1568
type_y             1568
cluster            1568
dtype: int64

Dropping unwanted columns having over 3million nun values this could peotentially mess with the analysis

In [ ]:
merged_data.drop(columns=['type_x','locale','locale_name','description','transferred'])

,year,month,day,dcoilwtico,store_nbr,transactions,id,family,sales,onpromotion,city,state,type_y,cluster
0,2012,3,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2012,11,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2012,11,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2012,11,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2012,11,11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3085939,2017,3,13,NaN,11.0,NaN,2722989.0,PLAYERS AND ELECTRONICS,12.0,0.0,Cayambe,Pichincha,B,6.0
3085940,2017,3,13,NaN,11.0,NaN,2722988.0,PET SUPPLIES,3.0,0.0,Cayambe,Pichincha,B,6.0
3085941,2017,3,13,NaN,11.0,NaN,2722987.0,PERSONAL CARE,364.0,16.0,Cayambe,Pichincha,B,6.0
3085942,2017,3,13,NaN,12.0,NaN,2722997.0,BEAUTY,2.0,1.0,Latacunga,Cotopaxi,C,15.0
3085943,2017,8,15,NaN,9.0,NaN,3000887.0,SEAFOOD,16.0,0.0,Quito,Pichincha,B,6.0

In [ ]:
merged_data['dcoilwtico'].ffill(inplace= True)

In [ ]:
merged_data['sales'].fillna(0, inplace=True)

In [ ]:
merged_data['onpromotion'].fillna(0, inplace=True)

In [ ]:
merged_data.isna().sum()

type_x          3085594
locale          3085594
locale_name     3085594
description     3085594
transferred     3085594
year                  0
month                 0
day                   0
dcoilwtico       466236
store_nbr          1568
transactions    3002456
id                85056
family            85056
sales                 0
onpromotion           0
city               1568
state              1568
type_y             1568
cluster            1568
dtype: int64

In [ ]:
merged_data['transactions'].fillna(merged_data['transactions'].median(), inplace=True)

In [ ]:
merged_data.dropna(subset=['store_nbr', 'family'], inplace=True)

In [ ]:
merged_data.isna().sum()

type_x          3000888
locale          3000888
locale_name     3000888
description     3000888
transferred     3000888
year                  0
month                 0
day                   0
dcoilwtico       460282
store_nbr             0
transactions          0
id                    0
family                0
sales                 0
onpromotion           0
city                  0
state                 0
type_y                0
cluster               0
dtype: int64

type_x, locale, locale_name, description, transferred

These columns have a high number of missing values, mostly in rows without holiday information.
Since not every date is a holiday, it makes sense to fill these missing values with a placeholder like "None" or "No Holiday.""

In [ ]:
# Fill missing holiday-related columns with 'None' or similar placeholder
merged_data['type_x'].fillna('No Holiday', inplace=True)
merged_data['locale'].fillna('No Locale', inplace=True)
merged_data['locale_name'].fillna('No Locale Name', inplace=True)
merged_data['description'].fillna('No Description', inplace=True)
merged_data['transferred'].fillna(False, inplace=True)

# Fill missing oil prices using forward fill method, backfill if necessary
merged_data['dcoilwtico'].fillna(method='ffill', inplace=True)
merged_data['dcoilwtico'].fillna(method='bfill', inplace=True)

# Set missing transactions to 0
merged_data['transactions'].fillna(0, inplace=True)

# Set missing sales and onpromotion values to 0
merged_data['sales'].fillna(0, inplace=True)
merged_data['onpromotion'].fillna(0, inplace=True)

# Fill missing store-related data (city, state, type, cluster) with placeholders or drop if necessary
merged_data['city'].fillna('Unknown City', inplace=True)
merged_data['state'].fillna('Unknown State', inplace=True)
merged_data['type_y'].fillna('Unknown Type', inplace=True)
merged_data['cluster'].fillna(-1, inplace=True)

# Drop rows with missing 'id' as they may not represent transactions
merged_data.dropna(subset=['id'], inplace=True)

C:\Users\pc\AppData\Local\Temp\ipykernel_4428\3919061564.py:9: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged_data['dcoilwtico'].fillna(method='ffill', inplace=True)
C:\Users\pc\AppData\Local\Temp\ipykernel_4428\3919061564.py:10: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  merged_data['dcoilwtico'].fillna(method='bfill', inplace=True)

MemoryError: Unable to allocate 137. MiB for an array with shape (6, 3000888) and data type float64

In [ ]:
merged_data.isna().sum()

type_x          0
locale          0
locale_name     0
description     0
transferred     0
year            0
month           0
day             0
dcoilwtico      0
store_nbr       0
transactions    0
id              0
family          0
sales           0
onpromotion     0
city            0
state           0
type_y          0
cluster         0
dtype: int64

In [ ]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3000888 entries, 41 to 3085943
Data columns (total 19 columns):
 #   Column        Dtype
---  ------        -----
 0   type_x        object
 1   locale        object
 2   locale_name   object
 3   description   object
 4   transferred   bool
 5   year          int32
 6   month         int32
 7   day           int32
 8   dcoilwtico    float64
 9   store_nbr     float64
 10  transactions  float64
 11  id            float64
 12  family        object
 13  sales         float64
 14  onpromotion   float64
 15  city          object
 16  state         object
 17  type_y        object
 18  cluster       float64
dtypes: bool(1), float64(7), int32(3), object(8)
memory usage: 403.5+ MB

In [ ]:
merged_data.isna().sum()

type_x          0
locale          0
locale_name     0
description     0
transferred     0
year            0
month           0
day             0
dcoilwtico      0
store_nbr       0
transactions    0
id              0
family          0
sales           0
onpromotion     0
city            0
state           0
type_y          0
cluster         0
dtype: int64

#### CATEGORICAL COLUMNS

In [ ]:
categorical_columns = merged_data.select_dtypes(include=['object']).columns

In [ ]:
# Select the columns you want to one-hot encode
categorical_columns = ['type_x', 'locale', 'locale_name', 'description', 'transferred', 'city', 'state', 'type_y']

# Apply one-hot encoding
df_encoded = pd.get_dummies(merged_data, columns=categorical_columns, drop_first=True)

In [ ]:
df_encoded.info()
df_encoded.head()

<class 'pandas.core.frame.DataFrame'>
Index: 3000888 entries, 41 to 3085943
Data columns (total 83 columns):
 #   Column                                Dtype
---  ------                                -----
 0   transferred                           bool
 1   year                                  int32
 2   month                                 int32
 3   day                                   int32
 4   dcoilwtico                            float64
 5   store_nbr                             float64
 6   transactions                          float64
 7   id                                    float64
 8   sales                                 float64
 9   onpromotion                           float64
 10  cluster                               float64
 11  family_BABY CARE                      bool
 12  family_BEAUTY                         bool
 13  family_BEVERAGES                      bool
 14  family_BOOKS                          bool
 15  family_BREAD/BAKERY                   bool
 16  family_CELEBRATION                    bool
 17  family_CLEANING                       bool
 18  family_DAIRY                          bool
 19  family_DELI                           bool
 20  family_EGGS                           bool
 21  family_FROZEN FOODS                   bool
 22  family_GROCERY I                      bool
 23  family_GROCERY II                     bool
 24  family_HARDWARE                       bool
 25  family_HOME AND KITCHEN I             bool
 26  family_HOME AND KITCHEN II            bool
 27  family_HOME APPLIANCES                bool
 28  family_HOME CARE                      bool
 29  family_LADIESWEAR                     bool
 30  family_LAWN AND GARDEN                bool
 31  family_LINGERIE                       bool
 32  family_LIQUOR,WINE,BEER               bool
 33  family_MAGAZINES                      bool
 34  family_MEATS                          bool
 35  family_PERSONAL CARE                  bool
 36  family_PET SUPPLIES                   bool
 37  family_PLAYERS AND ELECTRONICS        bool
 38  family_POULTRY                        bool
 39  family_PREPARED FOODS                 bool
 40  family_PRODUCE                        bool
 41  family_SCHOOL AND OFFICE SUPPLIES     bool
 42  family_SEAFOOD                        bool
 43  city_Babahoyo                         bool
 44  city_Cayambe                          bool
 45  city_Cuenca                           bool
 46  city_Daule                            bool
 47  city_El Carmen                        bool
 48  city_Esmeraldas                       bool
 49  city_Guaranda                         bool
 50  city_Guayaquil                        bool
 51  city_Ibarra                           bool
 52  city_Latacunga                        bool
 53  city_Libertad                         bool
 54  city_Loja                             bool
 55  city_Machala                          bool
 56  city_Manta                            bool
 57  city_Playas                           bool
 58  city_Puyo                             bool
 59  city_Quevedo                          bool
 60  city_Quito                            bool
 61  city_Riobamba                         bool
 62  city_Salinas                          bool
 63  city_Santo Domingo                    bool
 64  state_Bolivar                         bool
 65  state_Chimborazo                      bool
 66  state_Cotopaxi                        bool
 67  state_El Oro                          bool
 68  state_Esmeraldas                      bool
 69  state_Guayas                          bool
 70  state_Imbabura                        bool
 71  state_Loja                            bool
 72  state_Los Rios                        bool
 73  state_Manabi                          bool
 74  state_Pastaza                         bool
 75  state_Pichincha                       bool
 76  state_Santa Elena                     bool
 77  state_Santo Domingo de los Tsachilas  bool
 78  state_Tungurahua                      bool
 79  type_y_B                              bool
 80  type_y_C                              bool
 81  type_y_D                              bool
 82  type_y_E                              bool
dtypes: bool(73), float64(7), int32(3)
memory usage: 426.4 MB

,transferred,year,month,day,dcoilwtico,store_nbr,transactions,id,sales,onpromotion,...,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua,type_y_B,type_y_C,type_y_D,type_y_E
41,False,2013,8,15,104.9,47.0,1393.0,404093.0,723.0,0.0,...,False,False,True,False,False,False,False,False,False,False
42,False,2013,8,15,104.9,47.0,1393.0,404092.0,1441.0,0.0,...,False,False,True,False,False,False,False,False,False,False
43,False,2013,8,15,104.9,47.0,1393.0,404091.0,0.0,0.0,...,False,False,True,False,False,False,False,False,False,False
44,False,2013,8,15,104.9,47.0,1393.0,404087.0,9.0,0.0,...,False,False,True,False,False,False,False,False,False,False
45,False,2013,8,15,104.9,47.0,1393.0,404089.0,0.0,0.0,...,False,False,True,False,False,False,False,False,False,False

In [ ]:
merged_data['sales'].info()
merged_data['transactions'].info()
merged_data['dcoilwtico'].info()

<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: sales
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB
<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: transactions
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB
<class 'pandas.core.series.Series'>
Index: 3000888 entries, 41 to 3085943
Series name: dcoilwtico
Non-Null Count    Dtype
--------------    -----
3000888 non-null  float64
dtypes: float64(1)
memory usage: 45.8 MB

### FEATURE ENGINEERING

### Rolling features

Getting the 7-day rolling average of sales

In [45]:
merged_data['sales_7d_avg'] = merged_data['sales'].rolling(window=7).mean()

Using Lag features